UCM-PAYLOAD-PUT

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ucm="http://www.oracle.com/UCM">
   <soapenv:Header>
    <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
      <wsu:Timestamp wsu:Id="TS-BFF15FC1B9CA6F412814395870568816">
        <wsu:Created>%%ISOTIME%%</wsu:Created>
      </wsu:Timestamp>
      <wsse:UsernameToken wsu:Id="UsernameToken-2" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
        <wsse:Username>%%USERNAME%%</wsse:Username>
        <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">%%PASSWORD%%</wsse:Password>
       </wsse:UsernameToken>
    </wsse:Security>
  </soapenv:Header>
   <soapenv:Body>
      <ucm:GenericRequest webKey="cs">
         <ucm:Service IdcService="CHECKIN_NEW">
            <ucm:Document>
                <ucm:Field name="dSecurityGroup">FAFusionImportExport</ucm:Field>
                <ucm:Field name="dDocAccount">hcm$/dataloader$/import$</ucm:Field>
                <ucm:Field name="dDocType">Application</ucm:Field>
                <ucm:Field name="dFormat">application/zip</ucm:Field>
                <ucm:Field name="dOriginalName">%%FILEBASE%%</ucm:Field>
                <ucm:Field name="dExtension">zip</ucm:Field>
                <ucm:Field name="dWebExtension">zip</ucm:Field>
                <ucm:Field name="dID">%%FILEBASE%%</ucm:Field>
                <ucm:Field name="dDocTitle">%%FILEBASE%%</ucm:Field>
                <ucm:Field name="dDocName">%%FILEBASE%%</ucm:Field>
                <ucm:File  name="primaryFile" href="%%FILEBASE%%">
                  <ucm:Contents>%%FILEBODY%%</ucm:Contents>
                </ucm:File>
            </ucm:Document>
         </ucm:Service>
      </ucm:GenericRequest>
   </soapenv:Body>
</soapenv:Envelope>
